# khởi tạo các thông số của màn hình
class Screen:
    WIDTH = 640
    HEIGHT = 480
    FPS = 60
    TSIZE = 32
    GRIDWIDTH = WIDTH / TSIZE
    GRIDHEIGHT = HEIGHT / TSIZE

# khởi tạo một ma trận 1 là nơi enemy có thế di 0 là không để tạo tuyển đường cho enemy
class Map:
    MATRIX = [
        [0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0], # (272, 16) (304, 16) (336, 16)
        [0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], # (624, 112)
        [0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], # (624, 144)
        [0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], # (624, 176)
        [0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0], # (112, 240)
        [0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0], # (112, 272)
        [0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        [0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        [0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0]
    ]

# khởi tạo thông số của font chữ
class Font:
    f1 = "resources/font.ttf"

# khởi tạo thông số của kích thước font chữ
class FontSize:
    h0 = 12
    h1 = 15
    h2 = 20
    h3 = 25
    h4 = 30
    h5 = 35
    h6 = 40
    h7 = 45

# khởi tạo thông số màu sắc
class Color:
    primary = "#b68f40"
    red = "Red"
    white = "White"
    black = "Black"
    green = "#3b8335"